### 수치값을 카테고리값으로 변환하기

In [4]:
import numpy as np
import pandas as pd

price = np.random.randint(100, size=8)*10000
cars = pd.DataFrame(price, columns=['price'])
cars

    price
0  130000
1  360000
2  250000
3  640000
4  970000
5  490000
6  260000
7  390000

In [5]:
group_names = ['저급', '중급', '고급']

cars['Level'], mybin = pd.cut(cars['price'], 3, labels=group_names, retbins=True)

cars

    price Level
0  130000    저급
1  360000    저급
2  250000    저급
3  640000    중급
4  970000    고급
5  490000    중급
6  260000    저급
7  390000    저급

In [6]:
mybin

array([129160., 410000., 690000., 970000.])

## 카테고리(Categorical)값을 수치(Quantitative)값으로 변환하기

In [12]:
ary = [[1, 1.1, '손'], [2, 2.2, '날개'], [3, 3.3, '손']]
data = pd.DataFrame(ary, columns=['수온', '상온', 'hand'])
pd.get_dummies(data['hand'])

   날개  손
0   0  1
1   1  0
2   0  1

In [14]:
ary = [[1, 1.1, '손'], [2, 2.2, '날개'], [3, 3.3, '손']]
data = pd.DataFrame(ary, columns=['수온', '상온', 'hand'])
data = pd.concat([data, pd.get_dummies(data['hand'])], axis=1, sort=False)
data

   수온   상온 hand  날개  손
0   1  1.1    손   0  1
1   2  2.2   날개   1  0
2   3  3.3    손   0  1

In [15]:
ary = [[1, 1.1, '손'], [2, 2.2, '날개'], [3, 3.3, '손']]
data = pd.DataFrame(ary, columns=['수온', '상온', 'hand'])
data = pd.concat([data, pd.get_dummies(data['hand'])], axis=1, sort=False)
data.drop(['hand'], axis=1, inplace=True)
data

   수온   상온  날개  손
0   1  1.1   0  1
1   2  2.2   1  0
2   3  3.3   0  1